% 自相关法求时延
% 使用平台 - Matlab7.1


clc
clear all
close all

%--------------------------------------------------------------------------
% 产生 Chen 时间序列

a = 35;             % Lorenz 方程参数 a = 16 | 10
b = 3;                  %                 b = 4 | 8/3
c = 28;              %                 c = 45.92 | 28        

y = [-1,0,1];           % 起始点 (1 x 3 的行向量)
% y = [2,2,20];
h = 0.01;               % 积分时间步长

%k1 = 30000;             % 前面的迭代点数
k1 = 30000;
k2 = 5000;              % 后面的迭代点数

%z = LorenzData(y,h,k1+k2,sigma,r,b);
Chen = @(t,y)[a*(y(2)-y(1));
          (c-a)*y(1)-y(1)*y(3)+c*y(2);
          -b*y(3)+y(1)*y(2)];
T = 0:h:h*(k1+k2);
[T,z] = ode45(Chen,T,y);

X = z(k1+1:end,1);

%--------------------------------------------------------------------------
% 自相关法 (直接求 tau)
% 自相关函数下降到初始值的 1-1/e 时的 tau 即为所求 (tau 从 1 开始)

maxLags = 70;
IsPlot = 1;
t_AutoCorrelation = AutoCorrelation(X,maxLags,IsPlot)
